;
/***** JS Homework #12.25 Working with timers, setTimeout and setInterval, localStorage, sessionStorage *****/


console.log('-----------------------------------');
/******* JS Homework #12.25. JS slider *******/
console.log('*** JS Homework #12.25. JS slider ***');



//Данное задание не обязательно для выполнения
//
//Задание
//Реализовать слайдер на чистом Javascript.
//
//Технические требования:
//
//Создать HTML разметку, содержащую кнопки Previous, Next, и картинки (6 штук), которые будут пролистываться горизонтально.
//На странице должна быть видна только одна картинка. Слева от нее будет кнопка Previous, справа - Next.
//По нажатию на кнопку Next - должна появиться новая картинка, следующая из списка.
//По нажатию на кнопку Previous - должна появиться предыдущая картинка.
//Слайдер должен быть бесконечным, т.е. если в начале нажать на кнопку Previous, то покажется последняя картинка, а если нажать на Next, когда видимая - последняя картинка, то будет видна первая картинка.
//Пример работы слайдера можно увидеть здесь (первый пример). http://kenwheeler.github.io/slick/



